spec/cassettes/issuing_an_offline_refund_as_an_admin/sets_category_to_refund_for_offline_refunds.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=student2%40example.com
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Oliphaunt.local 16.7.0 Darwin Kernel Version 16.7.0: Wed Oct  4 00:17:00 PDT
        2017; root:xnu-3789.71.6~1/RELEASE_X86_64 x86_64","hostname":"Oliphaunt.local"}'
      Content-Length:
      - '28'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 16 Dec 2017 19:29:39 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '870'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_fZBAV9nviSROKI
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_BxgjYSO6jkdvLT",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BxgjYSO6jkdvLT/bank_accounts"
          },
          "created": 1513452579,
          "currency": null,
          "default_bank_account": null,
          "default_source": null,
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "student2@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BxgjYSO6jkdvLT/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BxgjYSO6jkdvLT/subscriptions"
          },
          "default_source_type": null
        }
    http_version: 
  recorded_at: Sat, 16 Dec 2017 19:29:39 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_BxgjYSO6jkdvLT/sources
    body:
      encoding: UTF-8
      string: source[object]=card&source[number]=4242424242424242&source[exp_month]=12&source[exp_year]=2020&source[cvc]=123
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Oliphaunt.local 16.7.0 Darwin Kernel Version 16.7.0: Wed Oct  4 00:17:00 PDT
        2017; root:xnu-3789.71.6~1/RELEASE_X86_64 x86_64","hostname":"Oliphaunt.local"}'
      Content-Length:
      - '110'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 16 Dec 2017 19:29:40 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '568'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_J7OqhrEceZDXcX
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_BxgjBABh7zZeln",
          "object": "card",
          "address_city": null,
          "address_country": null,
          "address_line1": null,
          "address_line1_check": null,
          "address_line2": null,
          "address_state": null,
          "address_zip": null,
          "address_zip_check": null,
          "brand": "Visa",
          "country": "US",
          "customer": "cus_BxgjYSO6jkdvLT",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2020,
          "fingerprint": "B5I5Hkz6r7cWlvfb",
          "funding": "credit",
          "last4": "4242",
          "metadata": {},
          "name": null,
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Sat, 16 Dec 2017 19:29:40 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_BxgjYSO6jkdvLT
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Oliphaunt.local 16.7.0 Darwin Kernel Version 16.7.0: Wed Oct  4 00:17:00 PDT
        2017; root:xnu-3789.71.6~1/RELEASE_X86_64 x86_64","hostname":"Oliphaunt.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 16 Dec 2017 19:29:41 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1612'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_VHk1iVtNIOfUcE
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_BxgjYSO6jkdvLT",
          "object": "customer",
          "account_balance": 0,
          "bank_accounts": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BxgjYSO6jkdvLT/bank_accounts"
          },
          "created": 1513452579,
          "currency": null,
          "default_bank_account": null,
          "default_source": "card_BxgjBABh7zZeln",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "student2@example.com",
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_BxgjBABh7zZeln",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_BxgjYSO6jkdvLT",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2020,
                "fingerprint": "B5I5Hkz6r7cWlvfb",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_BxgjYSO6jkdvLT/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_BxgjYSO6jkdvLT/subscriptions"
          },
          "default_source_type": "card"
        }
    http_version: 
  recorded_at: Sat, 16 Dec 2017 19:29:40 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_BxgjYSO6jkdvLT/sources/card_BxgjBABh7zZeln
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.58.0
      Authorization:
      - Bearer <STRIPE_API_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2016-02-03'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.58.0","lang":"ruby","lang_version":"2.4.1 p111 (2017-03-22)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        Oliphaunt.local 16.7.0 Darwin Kernel Version 16.7.0: Wed Oct  4 00:17:00 PDT
        2017; root:xnu-3789.71.6~1/RELEASE_X86_64 x86_64","hostname":"Oliphaunt.local"}'
      Host:
      - api.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 16 Dec 2017 19:29:43 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '568'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_dt3dpLBSmnkM6O
      Stripe-Version:
      - '2016-02-03'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_BxgjBABh7zZeln",
          "object": "card",
          "address_city": null,
          "address_country": null,
          "address_line1": null,
          "address_line1_check": null,
          "address_line2": null,
          "address_state": null,
          "address_zip": null,
          "address_zip_check": null,
          "brand": "Visa",
          "country": "US",
          "customer": "cus_BxgjYSO6jkdvLT",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2020,
          "fingerprint": "B5I5Hkz6r7cWlvfb",
          "funding": "credit",
          "last4": "4242",
          "metadata": {},
          "name": null,
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Sat, 16 Dec 2017 19:29:42 GMT
- request:
    method: post
    uri: https://m.stripe.com/4
    body:
      encoding: UTF-8
      string: JTdCJTIydjIlMjIlM0ExJTJDJTIyaWQlMjIlM0ElMjJlMGVjYWY3MTU0YmM5ODZhMGE5ODRmNWU4MzUxMGY1NSUyMiUyQyUyMnQlMjIlM0ExNS42ODklMkMlMjJ0YWclMjIlM0ElMjI0LjUuMTclMjIlMkMlMjJzcmMlMjIlM0ElMjJqcyUyMiUyQyUyMmElMjIlM0FudWxsJTJDJTIyYiUyMiUzQSU3QiUyMmElMjIlM0ElMjJodHRwJTNBJTJGJTJGMTI3LjAuMC4xJTNBNTUyNDclMkZzdHVkZW50cyUyRjElMkZwYXltZW50cyUyMiUyQyUyMmIlMjIlM0ElMjJodHRwJTNBJTJGJTJGMTI3LjAuMC4xJTNBNTUyNDclMkZzdHVkZW50cyUyRjElMkZwYXltZW50cyUyMiUyQyUyMmMlMjIlM0ElMjJFcGljZW50ZXIlMjIlMkMlMjJkJTIyJTNBJTIyZDcwM2I4OWEtNWQ4YS00Yjk3LWJmZjktMDRkMDIxYjY1YmUxJTIyJTJDJTIyZSUyMiUzQSUyMjhkOWQzMmQ1LWI2NzktNGU1Zi05YTI3LWMwZmE2ZGVlOTg3MSUyMiUyQyUyMmYlMjIlM0FmYWxzZSUyQyUyMmclMjIlM0F0cnVlJTJDJTIyaCUyMiUzQWZhbHNlJTJDJTIyaSUyMiUzQSU1QiUyMmJnQ29sb3IlMjIlMkMlMjJhbGlua0NvbG9yJTIyJTJDJTIyd2lkdGglMjIlMkMlMjJwbHVnaW5zJTIyJTJDJTIyaGVpZ2h0JTIyJTJDJTIyZmdDb2xvciUyMiUyQyUyMnZsaW5rQ29sb3IlMjIlMkMlMjJhbGwlMjIlMkMlMjJlbWJlZHMlMjIlMkMlMjJzY3JpcHRzJTIyJTJDJTIyY29tcGF0TW9kZSUyMiUyQyUyMmFjdGl2ZUVsZW1lbnQlMjIlMkMlMjJkaXIlMjIlMkMlMjJkZXNpZ25Nb2RlJTIyJTJDJTIybGlua0NvbG9yJTIyJTJDJTIyZG9jdW1lbnRFbGVtZW50JTIyJTJDJTIycHJlZmVycmVkU3R5bGVzaGVldFNldCUyMiUyQyUyMnhtbFZlcnNpb24lMjIlMkMlMjJoaWRkZW4lMjIlMkMlMjJ3ZWJraXRGdWxsc2NyZWVuRWxlbWVudCUyMiUyQyUyMmxvY2F0aW9uJTIyJTJDJTIyeG1sRW5jb2RpbmclMjIlMkMlMjJpbXBsZW1lbnRhdGlvbiUyMiUyQyUyMndlYmtpdEZ1bGxzY3JlZW5FbmFibGVkJTIyJTJDJTIycmVmZXJyZXIlMjIlMkMlMjJ3ZWJraXRGdWxsU2NyZWVuS2V5Ym9hcmRJbnB1dEFsbG93ZWQlMjIlMkMlMjJoZWFkJTIyJTJDJTIyZGVmYXVsdFZpZXclMjIlMkMlMjJkb21haW4lMjIlMkMlMjJsYXN0TW9kaWZpZWQlMjIlMkMlMjJhbmNob3JzJTIyJTJDJTIyYXBwbGV0cyUyMiUyQyUyMndlYmtpdEN1cnJlbnRGdWxsU2NyZWVuRWxlbWVudCUyMiUyQyUyMmRvY3R5cGUlMjIlMkMlMjJpbWFnZXMlMjIlMkMlMjJ2aXNpYmlsaXR5U3RhdGUlMjIlMkMlMjJmb3JtcyUyMiUyQyUyMmNoYXJzZXQlMjIlMkMlMjJzdHlsZVNoZWV0cyUyMiUyQyUyMlVSTCUyMiUyQyUyMnJlYWR5U3RhdGUlMjIlMkMlMjJzZWxlY3RlZFN0eWxlc2hlZXRTZXQlMjIlMkMlMjJjaGFyYWN0ZXJTZXQlMjIlMkMlMjJ0aXRsZSUyMiUyQyUyMmNvb2tpZSUyMiUyQyUyMndlYmtpdElzRnVsbFNjcmVlbiUyMiUyQyUyMmJvZHklMjIlMkMlMjJpbnB1dEVuY29kaW5nJTIyJTJDJTIyeG1sU3RhbmRhbG9uZSUyMiUyQyUyMmRvY3VtZW50VVJJJTIyJTJDJTIyZGVmYXVsdENoYXJzZXQlMjIlMkMlMjJsaW5rcyUyMiUyQyUyMmN1cnJlbnRTY3JpcHQlMjIlMkMlMjJwcmV2aW91c1NpYmxpbmclMjIlMkMlMjJwYXJlbnROb2RlJTIyJTJDJTIybGFzdENoaWxkJTIyJTJDJTIyYmFzZVVSSSUyMiUyQyUyMmZpcnN0Q2hpbGQlMjIlMkMlMjJub2RlVmFsdWUlMjIlMkMlMjJ0ZXh0Q29udGVudCUyMiUyQyUyMm5vZGVUeXBlJTIyJTJDJTIybm9kZU5hbWUlMjIlMkMlMjJwcmVmaXglMjIlMkMlMjJjaGlsZE5vZGVzJTIyJTJDJTIybmV4dFNpYmxpbmclMjIlMkMlMjJvd25lckRvY3VtZW50JTIyJTJDJTIybmFtZXNwYWNlVVJJJTIyJTJDJTIybG9jYWxOYW1lJTIyJTJDJTIycGFyZW50RWxlbWVudCUyMiU1RCUyQyUyMmolMjIlM0ElNUIlMjJjb29raWVFbmFibGVkJTIyJTJDJTIybGFuZ3VhZ2UlMjIlMkMlMjJwcm9kdWN0U3ViJTIyJTJDJTIybWltZVR5cGVzJTIyJTJDJTIycHJvZHVjdCUyMiUyQyUyMmFwcENvZGVOYW1lJTIyJTJDJTIydmVuZG9yU3ViJTIyJTJDJTIydmVuZG9yJTIyJTJDJTIycGxhdGZvcm0lMjIlMkMlMjJhcHBOYW1lJTIyJTJDJTIyYXBwVmVyc2lvbiUyMiUyQyUyMnVzZXJBZ2VudCUyMiUyQyUyMnBsdWdpbnMlMjIlMkMlMjJvbkxpbmUlMjIlNUQlMkMlMjJuJTIyJTNBMjg1LjU4MzM5MjAwMDAwMDQlN0QlN0Q=
    headers:
      Referer:
      - https://m.stripe.network/inner.html
      Origin:
      - https://m.stripe.network
      User-Agent:
      - Mozilla/5.0 (Macintosh; Intel Mac OS X) AppleWebKit/538.1 (KHTML, like Gecko)
        PhantomJS/2.1.1 Safari/538.1
      Content-Type:
      - application/xml
      Accept:
      - "*/*"
      Content-Length:
      - '2892'
      Connection:
      - Keep-Alive
      Accept-Language:
      - en-US,*
      Host:
      - m.stripe.com
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 16 Dec 2017 19:33:04 GMT
      Content-Type:
      - text/plain
      Transfer-Encoding:
      - chunked
      Connection:
      - close
      Vary:
      - Accept-Encoding
      Set-Cookie:
      - m=afe628d2-51c7-474d-8252-055d9238290f; Expires=Tue, 14 Dec 2027 19:33:04
        GMT; Domain=m.stripe.com; Secure; HTTPOnly
      Access-Control-Allow-Origin:
      - https://m.stripe.network
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Headers:
      - Content-Type
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      Content-Encoding:
      - gzip
    body:
      encoding: UTF-8
      string: afe628d2-51c7-474d-8252-055d9238290f
    http_version: 
  recorded_at: Sat, 16 Dec 2017 19:33:03 GMT
recorded_with: VCR 4.0.0
